# Pandas

**What is Pandas?**
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

**Why Use Pandas?**
Pandas allows us to analyze big data and make conclusions based on statistical theories.

Pandas can clean messy data sets, and make them readable and relevant.

Relevant data is very important in data science.

**Installation of Pandas**

    Install it by running this cell:

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/sashaolshanova/opt/anaconda3/lib/python3.9/site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/sashaolshanova/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/sashaolshanova/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in /Users/sashaolshanova/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in /Users/sashaolshanova/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

**Import Pandas**

Once Pandas is installed, import it in your applications by adding the import keyword:

In [1]:
import pandas as pd

In [2]:
import numpy as np

Data sets in Pandas are usually multi-dimensional tables, called **DataFrames**.

**Series** is like a column, a DataFrame is the whole table.

We can use either dictionary or series object to create a new DataFrame:

In [4]:
df = pd.DataFrame({'A': [1,2,3,4], 'B': [5,6,7,8], 'C': [9,10,11,12]})
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

You can pass a list of columns to [] to select columns in that order. If a column is not contained in the DataFrame, an exception will be raised. Multiple columns can also be set in this manner:

In [5]:
df[['B', 'A']]

   B  A
0  5  1
1  6  2
2  7  3
3  8  4

In [5]:
df[['A', 'B']]

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

Getting values from an object with multi-axes selection uses the following notation (using .loc as an example, but the following applies to .iloc as well). Any of the axes accessors may be the null slice :. Axes left out of the specification are assumed to be :, e.g. p.loc['a'] is equivalent to p.loc['a', :, :].

**Object Type:**

<table>
    <tr><th> Object Type </th><th>Indexers </td></tr>
    <tr><td> Series </th><td>  s.loc[ indexer ] </td></tr>
    <tr><td> DataFrame </th><td> df.loc[ row_indexer, column_indexer ] </td></tr>

**Indexing columns is view**

By analogy to getting a entire list from 2d array by indexing as view, when pandas selects a single column from a DataFrame, pandas creates a view and not a copy.

In [6]:
df = pd.DataFrame({'A': [1,2,3,4], 'B': [5,6,7,8], 'C': [9,10,11,12]})
s = df['A'] #viev
s[0:2]=900
df

     A  B   C
0  900  5   9
1  900  6  10
2    3  7  11
3    4  8  12

In [20]:
df2 = pd.DataFrame({'A': [1,2,3,4], 'B': [5,6,7,8], 'C': [9,10,11,12]})
df2.loc[0, ['A','B']] = 100
df2

     A    B   C
0  100  100   9
1    2    6  10
2    3    7  11
3    4    8  12

**"Fancy indexing"** is **copy**

Whenever you make a subset selection, pandas creates either **a view or a copy.**

The SettingWithCopy warning gets triggered when you make a subset selection and then try to assign new values within this selection.

In [10]:
df = pd.DataFrame({'A': [1,2,3,4], 'B': [5,6,7,8], 'C': [9,10,11,12]})
SSS= df[['A', 'C']] #copy
SSS.loc[0:2,'A']=100
df
#The warning is correct. You try to set value on copy.

/var/folders/m8/v8_kdm011wg6m28tjk9k1lww0000gn/T/ipykernel_33442/3930379489.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  SSS.loc[0:2,'A']=100

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

**The correct way:**

In [11]:
df = pd.DataFrame({'A': [1,2,3,4], 'B': [5,6,7,8], 'C': [9,10,11,12]})
df.loc[0, ['A','B']] = 100
df

     A    B   C
0  100  100   9
1    2    6  10
2    3    7  11
3    4    8  12

<br>**Chain indexing - Multi-index**

In [12]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
FFF = pd.MultiIndex.from_tuples(hier_index)
df = pd.DataFrame(np.random.randn(6,2),index=FFF,columns=["A","B"])
df

             A         B
G1 1  0.025531  0.004768
   2  0.650119 -0.486317
   3 -0.410586  2.683617
G2 1  1.679767 -0.482007
   2  0.857967  0.866130
   3 -0.391702  0.494468

In [12]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [13]:
df.loc[('G1',2),'A'] = 1000
df

                A         B
G1 1     0.025531  0.004768
   2  1000.000000 -0.486317
   3    -0.410586  2.683617
G2 1     1.679767 -0.482007
   2     0.857967  0.866130
   3    -0.391702  0.494468

# Pandas dtypes

In [14]:
df3=pd.DataFrame({'integer_1'  : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
                 'mixed-int'  : [1, 2, 3, 4, 5, 6, 7, 8, 9, 'd'], 
                 'mixed-str'  : ['a','b','c','d','e','f','g','h','i',4],
                 'float_1'    : [3., 2., 8., 9., 6., 6., 10., 8., 6., 6.],
                 'text'       : ['a','b','c','d','e','f','g','h','i','jjj'],
                 'float_2'    : [11., 20., 13., 1., 15., 16., 2., 18.,10., 12.],
                 'integer_2'  : [11, 12, 13, 14, 15, 16, 17, 18,19, 20],
                 'two-values' : ['T', 'F', 'F', 'T','T', 'F', 'F', 'T','T','T'],
                 'category'   : ['clsA','clsB','clsA','clsC','clsA','clsB','clsC','clsB','clsA','clsA'],
                 'bool'       : [True,False,False,True,True,False,False,True,False,False],
                })

df3

,integer_1,mixed-int,mixed-str,float_1,text,float_2,integer_2,two-values,category,bool
0,1,1,a,3.0,a,11.0,11,T,clsA,True
1,2,2,b,2.0,b,20.0,12,F,clsB,False
2,3,3,c,8.0,c,13.0,13,F,clsA,False
3,4,4,d,9.0,d,1.0,14,T,clsC,True
4,5,5,e,6.0,e,15.0,15,T,clsA,True
5,6,6,f,6.0,f,16.0,16,F,clsB,False
6,7,7,g,10.0,g,2.0,17,F,clsC,False
7,8,8,h,8.0,h,18.0,18,T,clsB,True
8,9,9,i,6.0,i,10.0,19,T,clsA,False
9,10,d,4,6.0,jjj,12.0,20,T,clsA,False

In [15]:
df3.dtypes

integer_1       int64
mixed-int      object
mixed-str      object
float_1       float64
text           object
float_2       float64
integer_2       int64
two-values     object
category       object
bool             bool
dtype: object

**The dtype of the columns:**

    
* **int64:** Integer numbers


* **float64:** Floating point numbers


* **bool:** True and False values


* **datetime64:** time values


* **timedelta:** used to capture the difference between two DateTime values.


* **category:** used for finite list of text values


* **object:** used for text and for mixed column of numeric and text values. 

    numpy dtype: object (pointer to regular python object)
    

* **string** (StringDtype): used for text

    A new and exprimental dtype.

    Currently, the performance of object dtype and StringDtype are about the same.

In [15]:
df3['float_1'] = df3['float_1'].astype(int)
df3

,integer_1,mixed-int,mixed-str,float_1,text,float_2,integer_2,two-values,category,bool
0,1,1,a,3,a,11.0,11,T,clsA,True
1,2,2,b,2,b,20.0,12,F,clsB,False
2,3,3,c,8,c,13.0,13,F,clsA,False
3,4,4,d,9,d,1.0,14,T,clsC,True
4,5,5,e,6,e,15.0,15,T,clsA,True
5,6,6,f,6,f,16.0,16,F,clsB,False
6,7,7,g,10,g,2.0,17,F,clsC,False
7,8,8,h,8,h,18.0,18,T,clsB,True
8,9,9,i,6,i,10.0,19,T,clsA,False
9,10,d,4,6,jjj,12.0,20,T,clsA,False

## Apply vs. transform

HW: explanation on transfrom:
https://pbpython.com/pandas_transform.html

There are 2 types of operations: trasform and aggregation.

**Transform**: Converts EACH item of the data frame to another value.

**Aggregation**: Converts all items in a column (or row) to one value or to a set of values of different dimensions from the input.

In [16]:

df = pd.DataFrame({'a':[1,1,2,3],
                   'b':[4,5,6,7],
                   'c':[8,9,10,11]})
df

   a  b   c
0  1  4   8
1  1  5   9
2  2  6  10
3  3  7  11

### ***Apply*** function can perform an aggregation:

**Example 1:** Example 1: Each column is replaced by the sum of the column.

The result is **series**.

In [17]:
df.apply(sum, axis=0)

a     7
b    22
c    38
dtype: int64

**Example 2:** Each column is replaced by the fixed list [1,2,3].

The result is **series**.

In [19]:
df2=df.apply(lambda x: [1,2,3], axis=0)
df2
#type(df2)

   a  b  c
0  1  1  1
1  2  2  2
2  3  3  3

**Example 3:** If the function returns output of the same dimension as the input - apply also will do ***transform***:

Each column of 4d is replaced by array of 4d.

The result is **DataFrame**.

In [20]:
df.apply(lambda x: x+1, axis=0)

   a  b   c
0  2  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [21]:
df.apply(lambda x: [1,2,3,4], axis=1)

0    [1, 2, 3, 4]
1    [1, 2, 3, 4]
2    [1, 2, 3, 4]
3    [1, 2, 3, 4]
dtype: object

### ***Transform*** function on ***DataFrame object*** convers each item to other item.

Thus, it can get only function that return the same dimension of the input.

Return **DataFrame**


**Example 1:** Each item x is replaced by x+1.

The result is **DataFrame**.

In [22]:
df.transform(lambda x: x + 1)

   a  b   c
0  2  5   9
1  2  6  10
2  3  7  11
3  4  8  12


**Example 2:** Each item x is replaced by fix array [1,2,3,4].

The result is **DataFrame**.

In [23]:
df.transform(lambda x: [1,2,3,4])

   a  b  c
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

**Group by: split-apply-combine**
    
By “group by” we are referring to a process involving one or more of the following steps:

-Splitting the data into groups based on some criteria.

-Applying a function to each group independently.

-Combining the results into a data structure.

In [24]:
Animals = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),)

In [25]:
Animals

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [26]:
# default is axis=0
Animals.groupby("class").mean()

        max_speed
class
bird        206.5
mammal       69.1

## Filter

The filter operation is also aggregate, but the filter can only use the function that returns a SCALAR.

**For example:**
    

Notice: the input of the function is the whole DataFrame (like as apply), so the output of the sum function on the dataframe is series - not scalar !!!

In [27]:
df = pd.DataFrame({'a':[1,1,2,3],
                   'b':[4,5,6,7],
                   'c':[8,9,10,12]})
df

   a  b   c
0  1  4   8
1  1  5   9
2  2  6  10
3  3  7  12

In [28]:
try: df.groupby('a').filter(lambda x: x.sum()>2) #invalid function
except TypeError as e: print(e)

filter function returned a Series, but expected a scalar bool

In [29]:
df.groupby('a').filter(lambda x: x['a'].sum()>2) #valid function

   a  b   c
3  3  7  12

## Summary

Summary of function map/applymap/transform/agg/apply in Series, DataFrame, DataFrame.Groupby

### Series

|	|Operation|	Parameter to function	|lambda x: x/x.mean() - transformation	|lambda x: x.mean() - aggregation	|lambda x: x+1 - transromation|
|:---|:---|:---|:---|:---|:---|
|map|	Element-Wise (func or dict)	|value|	invalid - value has no mean() function	|invalid - value has no mean() function|	valid|
|transform|	Element-Wise|	value	|invalid - value has no mean() function|	invalid - value has no mean() function	|valid|
|apply| Element-wise|	value|	invalid - value has no mean() function	|invalid - value has no mean() function|	valid|
|agg|	Aggregation or Element-wise|	Series|	valid|valid |	valid|

### DataFrame

Transfrom cannot make an aggregation

|	|Operation|	Parameter to function	|lambda x: x/x.mean() - transformation	|lambda x: x.mean() - aggregation	|lambda x: x+1 - transromation|
|:---|:---|:---|:---|:---|:---|
|applymap|	Element-Wise Operations|	value|	invalid - value has no mean() function|	invalid - value has no mean() function|	valid|
|transform|	Element-Wise Operations|	Series|	valid - x.mean() on each x (Series)|	invalid - x.mean() is aggregation|	valid|
|agg/apply|	Aggregation or Element-wise|	Series|	valid - x.mean() on each x (Series)|	valid|	valid|

### DataFrame.Groupby

|  |Operation|	Parameter to function|	lambda x: x.mean() - aggregation|	lambda x: x * x["A"].mean() - aggregation|	{"colA": ["min", "max"], "colB": "lambda x: x.sum()"}|
|:---|:---|:---|:---|:---|:---|
|transform|	Element-Wise Operations|	Series|	valid - Applies the agg function to each value|	invalid - the series x has no access to df["colname"]|	invalid|
|agg|	Aggregation or Element-wise|	Series|	valid - Applies the aggregation function to each series|	invalid - the series x has no access to df["colname"]|	valid|
|apply|	Aggregation or Element-wise|	DataFrame|	valid - Applies the same function at once to all columns|	valid - the dataframe x HAS access to df["colname"]|	invalid|